Trabajo_final/app/controllers/branches_controller.rb

  def index
    @branches = Branch.all
---
SELECT "branches".* FROM "branches"

  def create
    @branch = Branch.new(branch_params)

    respond_to do |format|
      if @branch.save
---
INSERT INTO "branches" ("name", "address", "telephone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "aaa"], ["address", "bbb"], ["telephone", 123], ["created_at", "2022-11-24 18:30:24.697330"], ["updated_at", "2022-11-24 18:30:24.697330"]]

  def update
    respond_to do |format|
      if @branch.update(branch_params)
---
UPDATE "branches" SET "address" = ?, "updated_at" = ? WHERE "branches"."id" = ?  [["address", "nnn"], ["updated_at", "2022-11-24 18:09:10.797413"], ["id", 2]]

  def destroy
    @branch.schedules.clear.destroy_all
    # for each user with this branch, set branch to nil
    User.where(branch_id: params[:id]).each do |user|
      user.update(branch_id: nil)
    end
    @branch.destroy
---
DELETE FROM "schedules" WHERE "schedules"."branch_id" = ?  [["branch_id", 1]]
DELETE FROM "branches" WHERE "branches"."id" = ?  [["id", 1]]
SELECT "users".* FROM "users" WHERE "users"."branch_id" = ?  [["branch_id", 4]]
DELETE FROM "branches" WHERE "branches"."id" = ?  [["id", 4]]

    def set_branch
      @branch = Branch.find(params[:id])
---
SELECT "branches".* FROM "branches" WHERE "branches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]