Trabajo_final/app/controllers/schedules_controller.rb

  def create
    @schedule = @branch.schedules.build(schedule_params)

    if @schedule.save
---
INSERT INTO "schedules" ("branch_id", "day", "start_time", "end_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @schedule.update(schedule_params)
---
UPDATE "schedules" SET "end_time" = ?, "updated_at" = ? WHERE "schedules"."id" = ?  [["end_time", "2000-01-01 14:00:00"], ["updated_at", "2022-11-29 08:54:57.005830"], ["id", 2]]

  def destroy
    @schedule.destroy
---
DELETE FROM "schedules" WHERE "schedules"."id" = ?  [["id", 3]]

    def set_branch
      @branch = Branch.find(params[:branch_id])
---
SELECT "branches".* FROM "branches" WHERE "branches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def set_schedule
      p "-----------------------------------"
      puts @branch.id
      puts @branch.schedules.ids

      @schedule = @branch.schedules.find(params[:id])
---
SELECT "schedules".* FROM "schedules" WHERE "schedules"."branch_id" = ? AND "schedules"."id" = ? LIMIT ?  [["branch_id", 2], ["id", 2], ["LIMIT", 1]]
SELECT "schedules".* FROM "schedules" WHERE "schedules"."branch_id" = ? AND "schedules"."id" = ? LIMIT ?  [["branch_id", 3], ["id", 3], ["LIMIT", 1]]