Trabajo_final/app/controllers/users_controller.rb

INSERT INTO "users" ("branch_id", "role", "email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "sign_in_count", "current_sign_in_at", "last_sign_in_at", "current_sign_in_ip", "last_sign_in_ip", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    p user_params
    respond_to do |format|
      if @user.save

UPDATE "users" SET "branch_id" = ?, "role" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["branch_id", 4], ["role", 2], ["updated_at", "2022-11-29 17:33:24.270279"], ["id", 11]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)