Trabajo_final/app/views/users/_form.html.erb

    <%= f.label :branch %><br />
    <%= f.select :branch_id, options_from_collection_for_select(Branch.all, :id, :name, @user.branch_id), include_blank: true %>
---
SELECT "branches".* FROM "branches"